{ "translations": {
    "An error occurred when saving the action." : "Възникна грешка при запазване на действието.",
    "Action does not exist or is disabled." : "Действието не съществува или е деактивирано.",
    "This action is not enabled on public shares." : "Това действие не е активирано за публични споделяния.",
    "Failed to create the action variables." : "Неуспешно създаване на променливите за действие.",
    "Lua extension not installed on the server." : "Разширението Lua не е инсталирано на сървъра.",
    "No script was chosen." : "Не е избран скрипт.",
    "Run file action" : "Стартиране на действието с файла",
    "Pass files to a file action script and run it." : "Предава файлове на скрипт за действие на файлове и ги стартира.",
    "File actions" : "Действия с файлове",
    "An unexpected error occurred when running the action." : "Възникна неочаквана грешка при изпълнение на действието.",
    "Title is empty." : "Заглавието е празно.",
    "A script already exists with this title." : "Вече съществува скрипт с това заглавие.",
    "Scripting tool which allows administrators to expand the file options menu." : "Инструмент за скриптове, който позволява на администраторите да разширят менюто с опции за файлове.",
    "Allows administrators to write small scripts which users can run through via the file actions menu in the Files app!\n\n- **🌕 Lua:** Script in Lua, its simple and has plenty of online resources.\n- **⚡️Empower users:** Make hard tasks easy, straight from the Files app.\n- **🙋 Open to suggestions:** Are you missing a function in the scripting API? Open an issue on Github!\n- **🤖 Integration with Nextcloud Flow:** allows you to fully automate workflows\n\n\n⚠️**Attention** This app requires additional configuration, and may not be suitable for all users. Make sure to read the documentation thoroughly.\n\n⚠️**Attention** Scripts may modify and delete files permanently. Take care and make sure to read the documentation thoroughly before scripting." : "Позволява на администраторите да пишат малки скриптове, които потребителите могат да изпълняват през менюто за действия с файлове в приложението Файлове!\n\n- **🌕 Lua:** Скриптът в Lua е прост и има много онлайн ресурси.\n- **⚡️Овластява потребителите: ** Направете трудните задачи лесни, директно от приложението Файлове.\n- **🙋 Отворен за предложения:** Липсва ли ви функция в API за скриптове? Откриите проблема в Github!\n**🤖 Интеграция с потока Nextcloud Flow:** ви позволява да автоматизирате напълно работните процеси\n\n\n⚠️**Внимание** Това приложение изисква допълнителна конфигурация и може да не е подходящо за всички потребители. Уверете се, че сте прочели внимателно документацията, преди да го инсталирате.\n\n⚠️**Внимание**  Скриптовете могат да променят и изтриват файлове за постоянно. Не забравяйте да прочетете внимателно документацията, преди изготвяне на скрипт.",
    "Edit" : "Редактиране",
    "Delete" : "Изтриване",
    "Enabled" : "Включено",
    "Disabled" : "Изключено",
    "Back" : "Назад",
    "Variable name" : "Име на променливата",
    "User prompt" : "Потребителска подкана",
    "Input type" : "Тип въвеждане",
    "Large text area" : "Голяма текстова област",
    "Allow multiple selections" : "Позволяване на множество селекции",
    "Multi-select options" : "Опции за множествен избор",
    "Allowed MIME types (defaults to all)" : "Позволени типове MIME (по подразбиране за всички)",
    "Save" : "Запиши",
    "Text" : "Текст",
    "Checkbox" : "Отметка",
    "File picker" : "Инструмент за избор на файлове",
    "Multi-select" : "Множествен избор",
    "User inputs" : "Входове за потребители",
    "Specify any number of input values the user may provide when running this action. These will be accessible to the script via the get_input() function." : "Посочете произволен брой входни стойности, които потребителят може да предостави, когато изпълнява това действие. Те ще бъдат достъпни за скрипта чрез функцията get_input().",
    "Move to bottom" : "Преместване до долу",
    "Add input" : "Добавяне на въвеждане",
    "Script input name cannot be empty" : "Името за въвеждане на скрипта не може да бъде празно",
    "Script input name already in use." : "Името за въвеждане на скрипт вече се използва.",
    "Script name" : "Име на скрипта",
    "A short description of what this action will do …" : "Кратко описание на това какво ще направи това действие ...",
    "Enable script" : "Активиране на скрипта",
    "Allow on public shares" : "Разрешаване на публични споделяния",
    "Limit to groups" : "Ограничен достъп",
    "Select groups allowed to use this action" : "Избор на групи, на които е разрешено да използват това действие",
    "Limit to specific MIME type" : "Ограничаване до определен тип MIME",
    "Saved" : "Записано",
    "An error occurred during saving" : "Възникна грешка  по време на запазването",
    "Unknown error" : "Неизвестна грешка",
    "Select an action to perform" : "Избор на действието за изпълнение",
    "Select action to perform" : "Избор на действие за изпълнение",
    "Execute" : "Изпълни",
    "Action completed!" : "Действието е завършено!",
    "Action failed unexpectedly." : "Действието се провали неочаквано.",
    "File actions are small Lua scripts that can create, modify, and/or delete files programatically. These actions may be triggered by users to be run on their files. Please read the documentation for more information." : "Действията с файлове са малки Lua скриптове, които могат да създават, променят и/или изтриват файлове по програма. Тези действия могат да бъдат задействани от потребители, за да се изпълняват върху техните файлове. Моля, прочетете документацията за повече информация.",
    "File actions are not available because there is no available interpreter. Either install the Lua plugin on the server or enable the experimental interpreter." : "Действията с файлове не са налични, тъй като няма наличен интерпретатор. Или инсталирайте приставката Lua на сървъра, или активирайте експерименталния интерпретатор.",
    "New action" : "Ново действие",
    "Actions in menu" : "Действия в менюто",
    "Shows file actions directly in the file menu, instead of needing to select it through the 'More actions' modal." : "Показва действията на файла директно в менюто на файла, вместо да е необходимо да го избирате чрез модалния диалогов прозорец „Още действия“.",
    "Experimental interpreter" : "Експериментален интерпретатор",
    "It is highly recommended to run the PHP Lua extension on your server. If this is not possible, the experimental Lua interpreter may be used. This interpreter is still under development and may not always produce the expected results." : "Силно препоръчително е да стартирате разширението PHP Lua на вашия сървър. Ако това не е възможно, може да се използва експерименталният интерпретатор Lua. Този интерпретатор все още е в процес на разработване и може да не дава винаги очакваните резултати.",
    "Use experimental interpreter" : "Използване на експериментален интерпретатор",
    "More actions" : "Повече действия"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}