{ "translations": {
    "An error occurred when saving the action." : "S'ha produït un error en desar l'acció.",
    "Action does not exist or is disabled." : "L'acció no existeix o està desactivada.",
    "Failed to create the action variables." : "No s'han pogut crear les variables d'acció.",
    "Lua extension not installed on the server." : "L'extensió Lua no està instal·lada al servidor.",
    "No script was chosen." : "No s'ha escollit cap fitxer d’ordres.",
    "Run file action" : "Executeu l'acció del fitxer",
    "Pass files to a file action script and run it." : "Passeu fitxers a un fitxer d’ordres i executeu-lo.",
    "File actions" : "Arxivar accions",
    "An unexpected error occurred when running the action." : "S'ha produït un error inesperat en executar l'acció.",
    "Title is empty." : "El títol és buit.",
    "A script already exists with this title." : "Ja existeix un fitxer d’ordres amb aquest títol.",
    "Scripting tool which allows administrators to expand the file options menu." : "Eina de fitxers d’ordres que permet als administradors ampliar el menú d'opcions de fitxer.",
    "Edit" : "Edita",
    "Delete" : "Suprimeix",
    "Enabled" : "Habilitat",
    "Disabled" : "Inhabilitat",
    "Back" : "Torna",
    "Variable name" : "Nom de la variable",
    "Save" : "Desa",
    "Text" : "Text",
    "Checkbox" : "Casella de selecció",
    "User inputs" : "Entrades de l'usuari",
    "Specify any number of input values the user may provide when running this action. These will be accessible to the script via the get_input() function." : "Especifiqueu qualsevol nombre de valors d'entrada que l'usuari pugui proporcionar quan executeu aquesta acció. Aquests seran accessibles per a l'script mitjançant la funció get_input().",
    "Script name" : "Nom del fitxer d’ordres",
    "A short description of what this action will do …" : "Una breu descripció del que farà aquesta acció …",
    "Enable script" : "Activa el fitxer d’ordres",
    "Limit to groups" : "Limita a grups",
    "Saved" : "Desat",
    "An error occurred during saving" : "S'ha produït un error en desar",
    "Unknown error" : "Error desconegut",
    "Select an action to perform" : "Seleccioneu una acció per dur a terme",
    "Select action to perform" : "Seleccioneu l'acció a realitzar",
    "Execute" : "Execució",
    "Action completed!" : "Acció completada!",
    "Action failed unexpectedly." : "L'acció ha fallat de manera inesperada.",
    "File actions are small Lua scripts that can create, modify, and/or delete files programatically. These actions may be triggered by users to be run on their files. Please read the documentation for more information." : "Les accions de fitxers són petits fitxer d’ordres en Lua que poden crear, modificar i/o eliminar fitxers de manera programada. Aquestes accions poden ser activades pels usuaris per executar-les als seus fitxers. Si us plau, llegiu la documentació per obtenir més informació.",
    "New action" : "Nova acció",
    "More actions" : "Més accions"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}