{ "translations": {
    "Lua extension not installed on the server." : "Lua-Erweiterung auf dem Server nicht installiert.",
    "An error occurred when saving the action." : "Es ist ein Fehler beim Speichern der Aktion aufgetreten",
    "Action does not exist or is disabled." : "Die Aktion existiert nicht oder ist deaktiviert.",
    "Failed to create the action variables." : "Die Aktionsvariablen konnten nicht erstellt werden.",
    "File actions" : "Dateiaktionen",
    "An unexpected error occurred when running the action." : "Es ist ein unerwarteter Fehler bei der Ausführung der Aktion aufgetreten.",
    "Title is empty." : "Titel ist leer.",
    "A script already exists with this title." : "Ein Skript mit diesem Titel existiert bereits.",
    "Scripting tool which allows administrators to expand the file options menu." : "Skripting-Tool, mit dem die Administratoren das Menü der Dateioptionen erweitern können.",
    "Allows administrators to write small scripts which users can run through file actions menu in the Files app!\n\n- **🌕 Lua:** Script in Lua, its simple and has plenty of online resources.\n- **⚡️Empower users:** Make hard tasks easy, straight from the Files app.\n- **🙋 Open to suggestions:** Are you missing a function in the scripting API? Open an issue on Github!\n\n\n⚠️**Attention** This app requires additional configuration, and may not be suitable for all users. Make sure to read the documentation thoroughly before installing.\n\n⚠️**Attention** With great power comes great responsibility: scripts may modify and delete files permanently. Make sure to read the documentation thoroughly before scripting." : "Ermöglicht Administratoren, kleine Skripte zu schreiben, die die Benutzer über das Menü Datei-Aktionen in der Dateien-App ausführen können!\n\n- **🌕 Lua:** Skript in Lua, ist einfach und hat viele Online-Ressourcen.\n- **⚡️ Befähigung der Benutzer:** Mache schwierige Aufgaben einfach, direkt aus der Dateien-App.\n- **🙋 Offen für Vorschläge:** Vermisst du eine Funktion in der Scripting-API? Eröffne ein Issue auf GitHub!\n\n\n⚠️**Achtung** Diese App erfordert zusätzliche Konfiguration und ist möglicherweise nicht für alle Benutzer geeignet. Bitte lesen Sie die Dokumentation vor der Installation sorgfältig durch.\n\n⚠️**Achtung** Mit großer Macht kommt große Verantwortung: Skripte können Dateien dauerhaft verändern und löschen. Lesen Sie die Dokumentation sorgfältig durch, bevor Sie ein Skript erstellen.",
    "Edit" : "Bearbeiten",
    "Delete" : "Löschen",
    "Enabled" : "Aktiviert",
    "Disabled" : "Deaktiviert",
    "User inputs" : "Benutzereingaben",
    "Specify any number of input values the user may provide when running this action. These will be accessible to the script via the get_input() function." : "Gib eine beliebige Anzahl von Eingabewerten an, die der Benutzer bei der Ausführung dieser Aktion angeben kann. Auf diese kann das Skript über die Funktion get_input() zugreifen.",
    "Variable name" : "Variablenname",
    "User prompt …" : "Eingabeaufforderung …",
    "Script name" : "Skriptname",
    "A short description of what this action will do …" : "Eine kurze Beschreibung, was diese Aktion bewirken wird …",
    "Enable script" : "Skript aktivieren",
    "Request target folder" : "Zielordner anfragen",
    "Saved" : "Gespeichert",
    "An error occurred during saving" : "Es ist ein Fehler beim Speichern aufgetreten",
    "Select an action to perform" : "Auszuführende Aktion auswählen",
    "Select action to perform" : "Auszuführende Aktion auswählen",
    "Choose a folder …" : "Ordner auswählen",
    "Execute" : "Ausführen",
    "Action completed!" : "Aktion abgeschlossen",
    "Action failed unexpectedly." : "Aktion ist fehlgeschlagen",
    "Unknown error" : "Unbekannter Fehler",
    "File actions are small Lua scripts that can create, modify, and/or delete files programatically. These actions may be triggered by users to be run on their files. Please read the documentation for more information." : "Datei-Aktionen sind kleine Lua-Skripte, die programmgesteuert Dateien erstellen, ändern und/oder löschen können. Diese Aktionen können von Benutzern ausgelöst werden, um auf ihren Dateien ausgeführt zu werden. Bitte lese die Dokumentation für weitere Informationen.",
    "New action" : "Neue Aktion",
    "More actions" : "Weitere Aktionen"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}