{ "translations": {
    "An error occurred when saving the action." : "Es ist ein Fehler beim Speichern der Aktion aufgetreten",
    "Action does not exist or is disabled." : "Die Aktion existiert nicht oder ist deaktiviert.",
    "Failed to create the action variables." : "Die Aktionsvariablen konnten nicht erstellt werden.",
    "Lua extension not installed on the server." : "Lua-Erweiterung auf dem Server nicht installiert.",
    "No script was chosen." : "Es wurde kein Skript ausgewählt.",
    "Run file action" : "Dateiaktion ausführen",
    "Pass files to a file action script and run it." : "Dateien an ein Dateiaktionsskript übergeben und dieses ausführen.",
    "File actions" : "Dateiaktionen",
    "An unexpected error occurred when running the action." : "Es ist ein unerwarteter Fehler beim Ausführen der Aktion aufgetreten.",
    "Title is empty." : "Titel ist leer.",
    "A script already exists with this title." : "Ein Skript mit diesem Titel existiert bereits.",
    "Scripting tool which allows administrators to expand the file options menu." : "Skripting-Tool, mit dem die Administratoren das Menü der Dateioptionen erweitern können.",
    "Edit" : "Bearbeiten",
    "Delete" : "Löschen",
    "Enabled" : "Aktiviert",
    "Disabled" : "Deaktiviert",
    "Back" : "Zurück",
    "Variable name" : "Variablenname",
    "Save" : "Speichern",
    "Text" : "Text",
    "Checkbox" : "Checkbox",
    "User inputs" : "Benutzereingaben",
    "Specify any number of input values the user may provide when running this action. These will be accessible to the script via the get_input() function." : "Gib eine beliebige Anzahl von Eingabewerten an, die der Benutzer bei der Ausführung dieser Aktion angeben kann. Auf diese kann das Skript über die Funktion get_input() zugreifen.",
    "Script name" : "Skriptname",
    "A short description of what this action will do …" : "Eine kurze Beschreibung, was diese Aktion bewirken wird …",
    "Enable script" : "Skript aktivieren",
    "Request target folder" : "Zielordner anfragen",
    "Saved" : "Gespeichert",
    "An error occurred during saving" : "Es ist ein Fehler beim Speichern aufgetreten",
    "Unknown error" : "Unbekannter Fehler",
    "Select an action to perform" : "Auszuführende Aktion auswählen",
    "Select action to perform" : "Auszuführende Aktion auswählen",
    "Choose a folder …" : "Ordner auswählen",
    "Execute" : "Ausführen",
    "Action completed!" : "Aktion abgeschlossen",
    "Action failed unexpectedly." : "Aktion ist fehlgeschlagen",
    "File actions are small Lua scripts that can create, modify, and/or delete files programatically. These actions may be triggered by users to be run on their files. Please read the documentation for more information." : "Datei-Aktionen sind kleine Lua-Skripte, die programmgesteuert Dateien erstellen, ändern und/oder löschen können. Diese Aktionen können von Benutzern ausgelöst werden, um auf ihren Dateien ausgeführt zu werden. Bitte lese die Dokumentation für weitere Informationen.",
    "New action" : "Neue Aktion",
    "It is highly recommended to run the PHP Lua extension on your server. If this is not possible, the experimental Lua interpreter may be used. This interpreter is still under development and may not always produce the expected results." : "Es wird dringend empfohlen, die PHP-Lua-Erweiterung auf deinem Server auszuführen. Falls dies nicht möglich ist, kann der experimentelle Lua-Interpreter verwendet werden. Dieser Interpreter befindet sich noch in der Entwicklung und liefert möglicherweise nicht immer die erwarteten Ergebnisse.",
    "More actions" : "Weitere Aktionen",
    "User prompt …" : "Eingabeaufforderung …"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}