{ "translations": {
    "Lua extension not installed on the server." : "A Lua kiterjesztés nincs telepítve a kiszolgálóra.",
    "An error occurred when saving the action." : "Hiba történt a művelet mentése során.",
    "Action does not exist or is disabled." : "A művelet nem létezik vagy ki van kapcsolva.",
    "An unexpected error occurred when running the action." : "Váratlan hiba történt a művelet futtatása során.",
    "Failed to create the action variables." : "A művelet változóinak létrehozása sikertelen.",
    "Title is empty." : "A cím üres.",
    "A script already exists with this title." : "Már létezik parancsfájl ezzel a címmel.",
    "File actions" : "Fájlműveletek",
    "Scripting tool which allows administrators to expand the file options menu." : "Parancsfájlkészítő-eszköz, amely lehetővé teszik, hogy a rendszergazdák kibővítsék a fájlok menüjét.",
    "Allows administrators to write small scripts which users can run through file actions menu in the Files app!\n\n- **🌕 Lua:** Script in Lua, its simple and has plenty of online resources.\n- **⚡️Empower users:** Make hard tasks easy, straight from the Files app.\n- **🙋 Open to suggestions:** Are you missing a function in the scripting API? Open an issue on Github!\n\n\n⚠️**Attention** This app requires additional configuration, and may not be suitable for all users. Make sure to read the documentation thoroughly before installing.\n\n⚠️**Attention** With great power comes great responsibility: scripts may modify and delete files permanently. Make sure to read the documentation thoroughly before scripting." : "Lehetővé teszi, hogy a rendszergazdák ki parancsfájlokat írjanak, melyeket a felhaszálok a Fájlok alkalmazásban lévő fájlműveletek menüből futtathatnak.\n\n- **🌕 Lua:** Parancsfájlok Luában, egyszerű és számos online anyag érhető el róla.\n- **⚡️ Hatalom a felhasználók kezében:** Tegye könnyűvé a nehéz feladatokat, egyenesen a Fájlok alkalmazásból.\n- **🙋 Nyitottság a javaslatokra:** Valami hiányzik a parancsfájl API-ból? Nyisson egy jegyet a Githubon!\n\n\n⚠️**Figyelem** Az alkalmazás további konfigurációt igényel, és nem biztos, hogy minden felhasználó számára megfelelő. A telepítés előtt alaposan olvassa át a dokumentációt.\n\n⚠️**Figyelem** A nagy hatalom nagy felelősséggel jár: a parancsfájlok módosíthatják vagy véglegesen törölhetik a fájlokat. Parancsfájlok írása előtt alaposan olvassa át a dokumentációt.",
    "Edit" : "Szerkesztés",
    "Delete" : "Törlés",
    "Enabled" : "Engedélyezve",
    "Disabled" : "Letiltva",
    "User inputs" : "Felhasználói bemenetek",
    "Specify any number of input values the user may provide when running this action. These will be accessible to the script via the get_input() function." : "Adjon meg tetszőleges számú bemeneti értéket, amelyet a felhasználó megadhat a művelet futtatásakor. Ezek a get_input() függvény használatával lesznek elérhetők a parancsfájl számára.",
    "Variable name" : "Változónév",
    "User prompt …" : "Felhasználói kérdés…",
    "Script name" : "Parancsfájl neve",
    "A short description of what this action will do …" : "Rövid leírás arról, hogy a művelet mit csinál…",
    "Enable script" : "Parancsfájl engedélyezése",
    "Request target folder" : "Kérés célmappája",
    "Saved" : "Mentve",
    "An error occurred during saving" : "Hiba történt a mentés során",
    "Select action to perform" : "Válassza ki a végrehajtandó műveletet",
    "Select an action to perform" : "Válasszon egy végrehajtandó műveletet",
    "Choose a folder …" : "Válasszon mappát…",
    "Execute" : "Végrehajtás",
    "Action completed!" : "A művelet kész.",
    "Action failed unexpectedly." : "A művelet váratlanul sikertelen lett.",
    "Unknown error" : "Ismeretlen hiba",
    "File actions are small Lua scripts that can create, modify, and/or delete files programatically. These actions may be triggered by users to be run on their files. Please read the documentation for more information." : "A fájlműveletek olyan Lua parancsfájlok, melyek programozottan tudnak fájlokat létrehozni, módosítani vagy törölni. Ezeket a műveleteket a felhasználók tudják kiváltani a saját fájljaikon. További információkért olvassa el a dokumentációt.",
    "New action" : "Új művelet",
    "More actions" : "További műveletek"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}